{
  "How do I install pirated games?": "We do not provide support for piracy in this server. Read rule 3 in <#703302242123645010> for more information.\n",
  "What software do I need to inject a payload?": "**Windows:** [TegraRcmGUI](https://github.com/eliboa/TegraRcmGUI/releases/latest)\n**macOS / Web (Chromium-based browsers):** [Nintendo Switch Payload Loader](https://webcfw.sdsetup.com/)\n\n[More options](https://wiki.gbatemp.net/wiki/List_of_Switch_payloads)",
  "How do I install Android on the Switch?": "https://forum.xda-developers.com/t/rom-unofficial-8-1-switchroot-lineageos-15-1.3951389/\n\n**This is not by Team Neptune**",
  "How much space do I need for an emuMMC?": "An emuMMC takes about 30GB of storage, so a 64GB would be the minimum. For the best experience, you should use a 128GB or higher SD card.",
  "What DNS do I use?": "90DNS blocks all connections to Nintendo, while AquaticDNS allows some connections to Nintendo (such as Online) without telemetry.\n\n**Please note:** AquaticDNS is not ran by Team Neptune, so we can't guarantee it'll work as advertised.",
  "Why are my files disappearing from the SD?": "You may have a fake SD card. Try asking about your specific card in the general chat where others can look into it. ",
  "How do I know if an SD is fake?": "If you have the following symptoms it may be a fake card:\n\n- Data disappearing randomly\n\n- Data becoming corrupted\n\nThe following are things to look out for when buying a card:\n\n- Too good to be true sizes (ex. 128GB for $5)\n\n- Suspicious brands",
  "What does 0x0000 mean on TegraRCMgui?": "0x0000 means that the switch is patched and can not be hacked using the RCM vulnerability. You can always try using another cable to make sure, but the results are unlikely to change.\n\nThere is the option of mod chips instead, but they're hard to find and require soldering skills. Additionally, it costs about $150+ to buy a mod chip.",
  "Can I go online with mods?": "It's best to use an emuMMC and stay offline when using mods, this can keep your saves intact and prevent doing something to get you banned. However, if you are going to go online, be careful with what mods you use. Depending on what game you're playing, certain things are likely to ban you.\n\n**There is no concrete list of things that can ban you**",
  "Why aren't my games available in emuMMC/showing a cloud icon?": "This means your `Nintendo` folder is not available to the emuMMC. You have to copy `/Nintendo` to `/emuMMC/RAW1/`.\n\nIt should look somewhat like this after you copy the folder\n```\n\nSD CARD\n├── atmosphere\n├── bootloader\n├── config\n├── emuMMC\n│   └── RAW1\n│       └── Nintendo\n├── Nintendo\n└── switch\n\n```",
  "Why should I use an emuMMC?": "There are some benefits to using emuMMC.\n\n**sysNAND (aka internal memory):** Use this to play online without mods. This is where to play online without risking getting banned.\n\n**emuMMC (aka emuNAND):** Copy of your sysNAND that is stored on the SD card. *This should remain offline or use 90DNS at all times*\n\nThis allows you to play online on your sysNAND and do offline risky stuff on your emuNAND\n\nThe following is copied from sysNAND when you create the emuMMC\n- Save files\n- Games, but requires moving a folder (FAQ Search: “Why aren't my games available in emuMMC”)\n- Photos/Videos on Internal Memory\n- Profiles\n- All System Settings\n\n**⚠️ Important:** Do **not** connect the emuMMC to Nintendo in any way. This will most likely cause a ban due to mismatching logs. The best option to prevent connecting is to remove all internet settings *before* creating the emuMMC.",
  "Should I use Hekate or Fusee?": "While both should work fine, Hekate offers more features and is recommended by Team Neptune.",
  "Can I use online services on my switch?": "**⚠️ Important:** Do **not** connect the emuMMC to Nintendo in any way. This will most likely cause a ban due to mismatching logs.\n\nGenerally, you can connect safely to online services if you **haven't** done any of the following:\n\n- Install pirated games at *some* point (even if you uninstalled them)\n- Modify saves in online games\n- Do actions on your account that normal users can't do (custom avatars)\n\n**This is a non-exaustive list as we don't know everything Nintendo bans for. Do at your own risk.**",
  "Can I use exFAT formatted SD card?": "Using an exFAT formatted SD card is not recommended as it can corrupt easier on the Nintendo Switch. Using FAT32 instead is the better option.",
  "How do I get 90DNS?": "**⚠️ Important:** Do **not** connect the emuMMC to Nintendo in any way. This will most likely cause a ban due to mismatching logs.\n\n**90DNS**:\n\nA DNS service that allows you to safely connect to internet without connecting to Nintendo's services. Set the following DNS addresses in the connection setting(s) of your emuMMC:\n\n**1st IP**: `207.246.121.77`\n**2nd IP**: `163.172.141.219`",
  "Do I always need to inject a payload to use CFW?": "Yes, you need *some* payload injector such as a computer, portable, or hard mod.",
  "What is the best guide to use to setup CFW on my switch?": "https://switch.homebrew.guide/",
  "Where can I get sigpatches?": "The Switch AIO updater homebrew allows you to download them. As their general purpose is to allow piracy, Team Neptune will not be providing any help with installation or problems of said patches or pirated games afterwards.",
  "When should I fix archive bits?": "It never hurts to try fixing archive bits when you're having trouble using CFW on your switch, but primarily it's best to use when using macOS to manage the files on your SD card.",
  "How can I fix archive bits?": "If you're able to get into Hekate, go to:\n`Tools` -> `Arch bit * RCM * Touch * Pkg1/2` -> `Fix archive bit`",
  "Can my console get unbanned from Nintendo?": "No. Once you're banned, you're banned permanently. This is usually a console ban and not an account ban, so you can get a new console to use online services again.",
  "What is the correct layout for the SD card?": "Your SD card should have the following as bare *minimum*:\n```\n\nSD CARD\n├── atmosphere\n├── bootloader\n├── config\n├── Nintendo\n└── switch\n\n```",
  "What are sigpatches?": "Sigpatches allow you to run unsigned software, such as backups, pirated games and homebrew NSPs. \n\n**Team Neptune will not provide support for installations of these patches**",
  "What is DeepSea?": "DeepSea is basically a package of many things. We include Atmosphere CFW, Hekate Bootloader, and various homebrew software. While we do include software that can install software, Team Neptune does not encourage or provide support for installing pirated content.",
  "Does DeepSea include sigpatches?": "DeepSea does not include sigpatches by default. We also do not provide support for installing of the patches or software requiring them. All we help with regarding sigpatches is included in the following FAQ: \"Where can I get sigpatches?\"",
  "How do I format to FAT32?": "Windows: [guiformat](http://ridgecrop.co.uk/guiformat.exe)\nmacOS: **Follow below steps**\n\nIf your PC doesn't allow you to format your card to FAT32 you can do that in hekate:\n`Tools` -> `Arch bit · RCM · Touch · Partition` -> `Partition`",
  "Can I connect my emuMMC to Internet?": "**⚠️ Important:** Do **not** connect the emuMMC to Nintendo in any way. This will most likely cause a ban due to mismatching logs.",
  "How do I setup AutoRCM?": "> **Warning**\n> NEVER enable AutoRCM on an ipatched switch, it'll result in being bricked.\n\n`Tools` -> `Archive Bit - AutoRCM` -> `Enable AutoRCM`",
  "How do I check my Atmosphere version?": "If you're booted into HOS, you can check by going to:\n\n`System Settings` -> `System`",
  "What are the ban risks?": "Read this for more information:\n<https://discord.com/channels/703301751171973190/703302552594284594/824322420529823764>",
  "How do I update the firmware?": "You can by updating normally or through AiO Updater.",
  "What is the meaning of life?": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Twemoji12_1f9c0.svg/512px-Twemoji12_1f9c0.svg.png",
  "How do I setup exosphere?": "You can enable/disable exosphere by going to `/atmophere/config/exosphere.ini` on your SD card and editing the following:\n```\nblank_prodinfo_sysmmc=0\nblank_prodinfo_emummc=0\n```\n\n0 = Esosphere Disabled\n1 = Esosphere Enabled\n\nPlease note, using 90DNS (FAQ: *How do I get 90DNS?*) is still the best option to prevent connecting to Nintendo, as long as you have it setup on every internet connection (all wifi, ethernet, etc.) before connecting to them.",
  "What does Failed to init or mount SD mean?": "This usually means the SD card is unable to be read. Make sure it's in a compatible format such as exFAT or FAT32. (FAT32 is the recommended format)",
  "What formats does the Nintendo Switch support?": "FAT32 or exFAT. However, FAT32 is the recommended format.",
  "Does my account get banned if I get banned?": "Usually, it's a console ban, not an account ban. However, if you do something such as setting inappropriate profile pictures, or setting it to something the switch normally can't do, it might be an account ban.",
  "Why does my screen stay black after the Nintendo logo?": "This is usually because you have too many sysmodules on at once. Disable all of them by booting into `Hekate` and selecting `Payloads`, Selecting `CommonProblemResolver.bin` and then selecting `Disabling automatic sysmodule startup`.",
  "Will my games from Stock appear in emuMMC?": "Yes, at the initial creation of the emummc. Once created, Stock and emummc will be independent of each other.",
  "Why does adding mods crash my game?": "Some mods are incompatible with newer versions of a game. Additionally, a mod could be too large of a size.",
  "Why do I need to have games installed?": "Some homebrew require more RAM than the Album applet can provide. When you hold R while launching a game, you're giving the homebrew menu+apps extra RAM to be able to do more intensive tasks.",
  "How do I access hekate from CFW?": "Restarting your switch from within CFW will boot you back to Hekate.",
  "What does it mean if hekate says: there will be dragons?": "This means you're loading an older version of the hekate payload, but with newer SD card files. Make sure you update your payload injector's saved payload.",
  "Why doesn't Team Neptune support Tinfoil?": "The creator of the Tinfoil software is allegedly not a good person and the software is closed source, typically homebrew is open source so you know what you're actually running."
}
